# Append Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReferenceArrayArray..::..Append Method
ReferenceArrayArray Class See Also
---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual void Append(
	ReferenceArray item
)
```

Visual Basic
---
```text
Public Overridable Sub Append ( _
	item As ReferenceArray _
)
```

Visual C++
---
```text
public:
virtual void Append(
	ReferenceArray^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..ReferenceArray
# See Also
ReferenceArrayArray Class
Autodesk.Revit.DB Namespace